Repository: adimosh/IX.StandardExtensions
Catalog: src/IX.StandardExtensions/Resources.*.resx
Languages: de, es, fr, hi, it, ja, ro, ru

# ErrorPersistedQueuesCannotBeCopied
source: Attempting to copy the entire contents of a persisted queue is not a supported operation.
de: Der Versuch, den gesamten Inhalt einer persistenten Warteschlange zu kopieren, wird nicht unterstützt.
es: Intentar copiar todo el contenido de una cola persistente no es una operación admitida.
fr: Toute tentative de copie de l’intégralité du contenu d’une file d’attente persistante n’est pas une opération prise en charge.
hi: एक कायम कतार की पूरी सामग्री को कॉपी करने का प्रयास एक समर्थित ऑपरेशन नहीं है।
it: Il tentativo di copiare l'intero contenuto di una coda persistente non è un'operazione supportata.
ja: 永続キューの内容全体をコピーしようとしても、サポートされている操作ではありません。
ro: Încercarea de a copia întregul conținut al unei cozi persistente nu este o operațiune acceptată.
ru: Попытка скопировать все содержимое сохраненной очереди не поддерживается.

# ErrorPersistedQueuesCannotBeEnumerated
source: Attempting to enumerate a persisted queue is not a supported operation.
de: Der Versuch, eine persistente Warteschlange aufzulisten, ist kein unterstützter Vorgang.
es: Intentar enumerar una cola persistente no es una operación admitida.
fr: La tentative d’énumération d’une file d’attente persistante n’est pas une opération prise en charge.
hi: एक कायम कतार की गणना करने का प्रयास एक समर्थित ऑपरेशन नहीं है।
it: Il tentativo di enumerare una coda persistente non è un'operazione supportata.
ja: 永続化されたキューを列挙しようとしても、サポートされていない操作です。
ro: Încercarea de a enumera o coadă persistentă nu este o operațiune acceptată.
ru: Попытка перечислить сохраненную очередь не поддерживается.

# ErrorTheQueueIsCurrentlyInDisasterMode
source: The queue is currently in disaster mode, enumeration operations are disabled by design.
de: Die Warteschlange befindet sich derzeit im Notfallmodus, Enumerationsvorgänge sind standardmäßig deaktiviert.
es: La cola está actualmente en modo de desastre, las operaciones de enumeración están deshabilitadas por diseño.
fr: La file d’attente est actuellement en mode sinistre, les opérations d’énumération sont désactivées par conception.
hi: कतार वर्तमान में आपदा मोड में है, गणना संचालन डिजाइन द्वारा अक्षम हैं ।
it: La coda è attualmente in modalità di emergenza, le operazioni di enumerazione sono disabilitate in base alla progettazione.
ja: キューは現在障害モードで、列挙操作は設計上無効になっています。
ro: Coada este în prezent în modul dezastru, operațiunile de enumerare sunt dezactivate prin proiectare.
ru: Очередь в настоящее время находится в аварийном режиме, операции перечисления отключены по замыслу.

# ErrorArgumentInRange
source: The argument is in the undesired range.
de: Das Argument liegt im unerwünschten Bereich.
es: El argumento está en el rango no deseado.
fr: L’argument est dans la plage indésirable.
hi: तर्क अवांछित रेंज में है ।
it: L'argomento è nell'intervallo indesiderato.
ja: 引数が望ましくない範囲にあります。
ro: Argumentul este în intervalul nedorit.
ru: Аргумент находится в нежелательном диапазоне.

# ErrorArgumentNotGreaterThan
source: The argument is not greater than a desired value.
de: Das Argument ist nicht größer als ein gewünschter Wert.
es: El argumento no es mayor que un valor deseado.
fr: L’argument n’est pas supérieur à une valeur souhaitée.
hi: तर्क एक वांछित मूल्य से अधिक नहीं है ।
it: L'argomento non è maggiore di un valore desiderato.
ja: 引数が目的の値より大きくなっていません。
ro: Argumentul nu este mai mare decât o valoare dorită.
ru: Аргумент не превышает желаемого значения.

# ErrorArgumentNotGreaterThanOrEqualTo
source: The argument is not less than or equal to a desired value.
de: Das Argument ist nicht kleiner oder gleich einem gewünschten Wert.
es: El argumento no es menor o igual que un valor deseado.
fr: L’argument n’est ni inférieur ni égal à une valeur souhaitée.
hi: तर्क किसी वांछित मूल्य से कम या बराबर नहीं है ।
it: L'argomento non è minore o uguale a un valore desiderato.
ja: 引数が目的の値以下です。
ro: Argumentul nu este mai mic sau egal cu o valoare dorită.
ru: Аргумент не меньше или равен желаемому значению.

# ErrorArgumentNotInRange
source: The argument is not in the desired range.
de: Das Argument liegt nicht im gewünschten Bereich.
es: El argumento no está en el intervalo deseado.
fr: L’argument n’est pas dans la plage souhaitée.
hi: तर्क वांछित सीमा में नहीं है।
it: L'argomento non è nell'intervallo desiderato.
ja: 引数が目的の範囲にありません。
ro: Argumentul nu este în intervalul dorit.
ru: Аргумент не находится в нужном диапазоне.

# ErrorArgumentNotLessThan
source: The argument is not less than a desired value.
de: Das Argument ist nicht weniger als ein gewünschter Wert.
es: El argumento no es menor que un valor deseado.
fr: L’argument n’est pas inférieur à une valeur souhaitée.
hi: तर्क किसी वांछित मूल्य से कम नहीं है।
it: L'argomento non è minore di un valore desiderato.
ja: 引数が希望の値より小さい値です。
ro: Argumentul nu este mai mic decât o valoare dorită.
ru: Аргумент не меньше желаемого значения.

# ErrorArgumentNotLessThanOrEqualTo
source: The argument is not less than or equal to a desired value.
de: Das Argument ist nicht kleiner oder gleich einem gewünschten Wert.
es: El argumento no es menor o igual que un valor deseado.
fr: L’argument n’est ni inférieur ni égal à une valeur souhaitée.
hi: तर्क किसी वांछित मूल्य से कम या बराबर नहीं है ।
it: L'argomento non è minore o uguale a un valore desiderato.
ja: 引数が目的の値以下です。
ro: Argumentul nu este mai mic sau egal cu o valoare dorită.
ru: Аргумент не меньше или равен желаемому значению.

# ErrorArgumentNotNegative
source: The argument is not a negative number.
de: Das Argument ist keine negative Zahl.
es: El argumento no es un número negativo.
fr: L’argument n’est pas un nombre négatif.
hi: तर्क नकारात्मक संख्या नहीं है ।
it: L'argomento non è un numero negativo.
ja: 引数が負の数ではありません。
ro: Argumentul nu este un număr negativ.
ru: Аргумент не является отрицательным числом.

# ErrorArgumentNotNegativeInteger
source: The argument is not a negative integer.
de: Das Argument ist keine negative ganze Zahl.
es: El argumento no es un entero negativo.
fr: L’argument n’est pas un entier négatif.
hi: तर्क कोई नकारात्मक पूर्णांक नहीं है ।
it: L'argomento non è un numero intero negativo.
ja: 引数が負の整数ではありません。
ro: Argumentul nu este un întreg negativ.
ru: Аргумент не является отрицательным целым числом.

# NoHistoryLevelsException
source: No undo/redo stacks could be initialized, as there are no history levels defined.
de: Es konnten keine Rückgängig-/Wiederholungsstapel initialisiert werden, da keine Verlaufsebenen definiert sind.
es: No se pudo inicializar ninguna pila de deshacer/rehacer, ya que no hay niveles de historial definidos.
fr: Aucune pile d’annulation/rétablir n’a pu être initialisée, car aucun niveau d’historique n’est défini.
hi: कोई पूर्ववत/फिर से तैयार ढेर शुरू किया जा सकता है, के रूप में वहां कोई इतिहास का स्तर परिभाषित कर रहे हैं ।
it: Non è stato possibile inizializzare stack di annullamento/ro, in quanto non sono stati definiti livelli di cronologia.
ja: 履歴レベルが定義されていないため、元に戻す/やり直しスタックを初期化できませんでした。
ro: Nu s-a putut inițializa nicio anulare/refacere a stivelor, deoarece nu sunt definite niveluri de istoric.
ru: Стеки отмены/повтора не могут быть инициализированы, так как не определены уровни истории.

source: The collection is captured into a context, it cannot start an explicit transaction.
de: Die Auflistung wird in einem Kontext erfasst, sie kann keine explizite Transaktion starten.
es: La colección se captura en un contexto, no puede iniciar una transacción explícita.
fr: La collection est capturée dans un contexte, elle ne peut pas démarrer une transaction explicite.
hi: संग्रह को एक संदर्भ में कैप्चर किया गया है, यह एक स्पष्ट लेनदेन शुरू नहीं कर सकता है।
it: L'insieme viene acquisito in un contesto, non può avviare una transazione esplicita.
ja: コレクションはコンテキストにキャプチャされ、明示的なトランザクションを開始できません。
ro: Colecția este capturată într-un context, nu poate începe o tranzacție explicită.
ru: Коллекция записывается в контекст, она не может запустить явную транзакцию.

source: The given collection to remove is not contained in the initial collection.
de: Die angegebene zu entfernene Auflistung ist nicht in der ursprünglichen Auflistung enthalten.
es: La colección determinada que se va a quitar no está incluida en la colección inicial.
fr: La collection donnée à supprimer n’est pas contenue dans la collection initiale.
hi: हटाने के लिए दिया संग्रह प्रारंभिक संग्रह में निहित नहीं है।
it: La raccolta specificata da rimuovere non è contenuta nella raccolta iniziale.
ja: 削除する指定されたコレクションは、初期コレクションに含まれていません。
ro: Colecția dată de eliminat nu este conținută în colecția inițială.
ru: Заданная коллекция для удаления не содержится в исходной коллекции.

source: There already is an open undo transaction.
de: Es gibt bereits eine offene Rückgängig-Transaktion.
es: Ya hay una transacción de deshacer abierta.
fr: Il existe déjà une transaction d’annulation ouverte.
hi: वहां पहले से ही एक खुला पूर्ववत लेनदेन है ।
it: Esiste già una transazione di annullamento aperta.
ja: 既に、開いている元に戻すトランザクションがあります。
ro: Există deja o tranzacție deschisă de anulare.
ru: Уже существует открытая транзакция отмены.

source: Undo and Redo operations are not supported while an explicit transaction block is open.
de: Rückgängig- und Wiederholen-Vorgänge werden nicht unterstützt, während ein expliziter Transaktionsblock geöffnet ist.
es: Las operaciones Deshacer y Rehacer no se admiten mientras está abierto un bloque de transacciones explícito.
fr: Les opérations d’annulation et de rétablir ne sont pas prises en charge lorsqu’un bloc de transaction explicite est ouvert.
hi: एक स्पष्ट लेनदेन ब्लॉक खुला होने के दौरान पूर्ववत और रेडो संचालन का समर्थन नहीं किया जाता है।
it: Le operazioni annulla e Rifa non sono supportate mentre è aperto un blocco di transazioni esplicito.
ja: 明示的なトランザクション ブロックが開いている間は、元に戻す操作とやり直し操作はサポートされません。
ro: Operațiunile de anulare și refacere nu sunt acceptate în timp ce este deschis un bloc de tranzacții explicit.
ru: Операции отмены и повтора не поддерживаются, пока открыт явный блок транзакций.

source: Attempting to access an undo/redo stack while undo is disabled is not allowed.
de: Der Versuch, auf einen Rückgängig/Wiederholen-Stack zuzugreifen, während das Rückgängigmachen deaktiviert ist, ist nicht zulässig.
hi: पूर्ववत/रीडो स्टैक तक पहुंचने का प्रयास करते हुए पूर्ववत अक्षम होने की अनुमति नहीं है ।
it: Il tentativo di accedere a uno stack di annullamento/ro mentre l'annullamento è disabilitato non è consentito.
ja: 元に戻す/やり直しスタックにアクセスしようとしても、元に戻す操作が無効になっていません。
ro: Încercarea de a accesa o stivă de anulare/refacere în timp ce anularea este dezactivată nu este permisă.

source: The level dictionary has no more items.
de: Das Niveauwörterbuch enthält keine Elemente mehr.
hi: स्तर शब्दकोश में कोई और आइटम नहीं है।
