Repository: adimosh/IX.StandardExtensions
Catalog: src/IX.StandardExtensions/Resources.*.resx
Languages: de, es, fr, hi, it, ja, ro, ru

# ErrorLengthGoesPastArrayLimits
source: The length should be small enough to not result in an operation outside of the bounds of the array.
de: Die Länge sollte klein genug sein, um nicht zu einer Operation außerhalb der Grenzen des Arrays zu führen.
es: La composición del Consejo de Seguridad debería ser lo suficientemente pequeña como para que pueda trabajar eficazmente y lo suficientemente grande para que represente a los miembros actuales de las Naciones Unidas.
fr: La longueur devrait être suffisamment petite pour ne pas aboutir à une opération en dehors des limites du tableau.
hi: सरणी की सीमा के बाहर एक ऑपरेशन में परिणाम नहीं करने के लिए लंबाई काफी छोटी होनी चाहिए।
it: La lunghezza dovrebbe essere abbastanza piccola da non risultato in un'operazione di fuori dei limiti della matrice.
ja: 長さが配列の境界の外側の操作の結果ではなく小さくする必要があります!。
ro: Lungimea trebuie sp fie suficient de mică încât să nu resulte într-o operație în afara limitelor șirului.
ru: Длина должна быть достаточно мала, чтобы не привести к операции за пределами массива.

# ErrorLengthMustBeAPositiveInteger
source: The length should be a positive integer.
de: Die Länge sollte eine positive Ganzzahl sein.
es: La duración de la reserva debe ser un número positivo
fr: La longueur devrait être un entier positif.
hi: लंबाई एक सकारात्मक पूर्णांक होना चाहिए।
it: La lunghezza deve essere un numero intero positivo.
ja: 長さが正の整数にする必要があります!。
ro: Lungimea trebuie să fie un întreg pozitiv.
ru: Длина должна быть положительным целым числом.

# ErrorNotImplementedByDesign
source: This member is not implemented by design.
de: Dieses Mitglied ist nicht vom Design implementiert.
es: Esta función no está implementada todavía.
fr: Ce membre n'est pas implémenté par conception.!
hi: यह सदस्य डिजाइन द्वारा लागू नहीं किया जाता है।
it: Questo membro non è implementato da design.
ja: このメンバーはデザインによって実装されていません!。
ro: Acest membru este în mod intenționat neimplementat.
ru: Этот элемент не реализован по замыслу.

# ErrorSourceIndexMustPointToALocationWithinTheArray
source: The source index must point to a location within the array.
de: Der Quellindex muss auf eine Position innerhalb des Arrays zeigen.
es: Arrastra y suéltalo en una ubicación específica dentro de la línea de tiempo
fr: L'index source doit pointer vers un emplacement dans le tableau.!
hi: स्रोत सूचकांक को सरणी के भीतर किसी स्थान पर इंगित करना चाहिए।
it: L'indice di origine deve puntare a una posizione all'interno della matrice.
ja: これはボタンバーツールバーです。ここからゲームに関連するコマンドに簡単にアクセスできます。
ro: Indicele sursă trebuie să indice o locație din interiorul șirului.
ru: Исходный индекс должен указывать на расположение в массиве.

# ErrorArgumentInvalidType
source: The supplied boxed or polymorphic argument is of a wrong type.
de: Das angegebene Boxed-Argument hat einen falschen Typ.
es: El argumento en caja suministrado es de un tipo incorrecto.
fr: L'argument encadré fourni est de type incorrect.
hi: आपूर्ति बॉक्स्ड या बहुरूपिक तर्क एक गलत प्रकार का है।
it: La dotazione in scatola o argomento polimorfico è di un tipo sbagliato.
ja: 指定されたボックスまたはポリモーフィックな引数が間違った型のです!。
ro: Argumentul furnizat incapsulat sau polimorfic este de un tip greșit.
ru: Предоставленный коробчатый или полиморфный аргумент неправильного типа.

# ErrorStopRetrying
source: The operation that has made a call to this method should stop retrying, as a critical error, a state change or unrecoverable environment conditions guarantee failure on subsequent retries.
de: Die Operation, die diese Methode aufgerufen hat, sollte die erneute Ausführung stoppen, da ein kritischer Fehler, eine Statusänderung oder nicht behebbare Umgebungsbedingungen einen Fehler bei nachfolgenden Wiederholungen garantieren.
es: La operación que ha realizado una llamada a este método debe detener la reintentación, ya que un error crítico, un cambio de estado o condiciones irrecuperables del entorno garantizan fallas en los intentos posteriores.
fr: L'opération qui a effectué un appel à cette méthode doit cesser de réessayer, car une erreur critique, une modification d'état ou des conditions d'environnement irrécupérables garantissent l'échec lors des tentatives suivantes.
hi: ऑपरेशन है कि इस विधि के लिए एक फोन किया है फिर से प्रयास बंद कर देना चाहिए, एक महत्वपूर्ण त्रुटि के रूप में, एक राज्य परिवर्तन या अप्राप्य पर्यावरण की स्थिति बाद में retries पर विफलता की गारंटी ।
it: L'operazione che ha effettuato una chiamata a questo metodo deve interrompere il tentativo, come errore critico, una modifica dello stato o condizioni di ambiente irrecuperabili garantiscono un errore nei tentativi successivi.
ja: このメソッドを呼び出した操作は、重大なエラーとして、状態変更または回復不可能な環境条件が、その後の再試行でエラーを保証するため、再試行を停止する必要があります。
ro: Operațiunea care a făcut apel la această metodă ar trebui să se oprească din nou, ca o eroare critică, o schimbare de stat sau condiții de mediu nerecuperabile garantează eșec la reluările ulterioare.
ru: Операция, вызвавшая этот метод, должна прекратить повторную попытку, так как критическая ошибка, изменение состояния или невосстановимые условия среды гарантируют сбой при последующих повторных попытках.

# MoveNextNotInvoked
source: You must first invoke the MoveNext method before you can call Current.
de: Sie müssen zuerst die MoveNext-Methode aufrufen, bevor Sie Current aufrufen können.
es: Debes ingresar antes de que puedas publicar un anuncio o evento.
fr: Vous devez d'abord appeler la méthode MoveNext avant de pouvoir appeler Current.
hi: करंट कॉल करने से पहले आपको सबसे पहले मूवनेक्स्ट विधि का आह्वान करना होगा।
it: È innanzitutto necessario richiamare il metodo MoveNext prima di chiamare corrente.
ja: 最初電流を呼び出す前に MoveNext メソッドを呼び出す必要があります!。
ro: Mai întâi trebuie să invocați MoveNext înainte să puteți apela Current.
ru: Перед вызовом метода Current необходимо сначала вызвать метод MoveNext.

# DictionaryItemAlreadyExists
source: An item with the same key already exists in this dictionary.
de: Ein Element mit demselben Schlüssel bereits vorhanden ist, in diesem Wörterbuch.
es: Ya existe un objeto con el mismo nombre en este directorio.
fr: Un élément possédant la même clé existe déjà dans ce dictionnaire.
hi: एक ही कुंजी के साथ एक आइटम पहले से ही इस शब्दकोश में मौजूद है।
it: Un elemento con la stessa chiave è già presente in questo dizionario.
ja: このタクソノミーには同じ名称の項目がすでに存在しています。
ro: Un element cu aceeaşi cheie există deja în acest dicţionar.
ru: Элемент с таким же ключом уже существует в этом словаре.

# ItemAlreadyCapturedIntoUndoContextException
source: The operation could not be completed as the current item is trapped by an existing undo context.
de: Die Operation konnte nicht abgeschlossen werden, da das aktuelle Objekt von einem vorhandenen Rückgängig-Kontext gefangen wird.
es: No se pudo completar la operación como el elemento actual es atrapado por un contexto de deshacer existente.!
fr: L'opération n'a pas pu être terminée car l'élément en cours est intercepté par un contexte d'annulation existant.
hi: ऑपरेशन पूरा नहीं किया जा सका क्योंकि वर्तमान आइटम मौजूदा पूर्ववत संदर्भ से फंसा हुआ है ।
it: Impossibile completare l'operazione.
ja: 既存の undo コンテキストで現在の項目はトラップは、操作を完了できませんでした!。
ro: Operațiunea nu a putut fi executată deoarece elementul curent este prins într-un context de reversie.
ru: Операция не может быть завершена, так как текущий элемент захвачен существующим контекстом отмены.

# ItemIsInEditModeExceptionDefaultMessage
source: The operation could not be completed as the current item is in edit mode.
de: Der Vorgang konnte nicht abgeschlossen werden, da sich das aktuelle Element im Bearbeitungsmodus befindet.
es: No se pudo completar la operación como el elemento actual está en modo de edición.!
fr: L'opération n'a pas pu être terminée car l'élément actuel est en mode édition.
hi: वर्तमान आइटम एडिट मोड में होने के कारण ऑपरेशन पूरा नहीं हो सका।
it: L'operazione potrebbe non essere completata come l'elemento corrente è in modalità di modifica.
ja: 要求された操作は完了できませんでした
ro: Operațiunea nu a putut fi executată deoarece elementul este în modul de editare.
ru: Операция не может быть завершена, так как текущий элемент находится в режиме редактирования.

# ItemNotCapturedIntoUndoContextException
source: The operation could not be completed as the current item is not trapped into an existing undo context.
de: Die Operation konnte nicht abgeschlossen werden, da das aktuelle Element nicht in einem vorhandenen Rückgängig-Kontext gefangen ist.
es: No se pudo completar la operación como el elemento actual no está atrapado en un contexto de deshacer existente.!
fr: L'opération n'a pas pu être terminée car l'élément actuel n'est pas pris dans un contexte d'annulation existant.
hi: ऑपरेशन पूरा नहीं किया जा सका क्योंकि वर्तमान आइटम मौजूदा पूर्ववत संदर्भ में नहीं फंसा है ।
it: Impossibile completare l'operazione come l'elemento corrente non è intrappolato in un contesto di annullamento esistente.
ja: 元のファイルと出力先が同じファイルのため操作を完了できませんでした。
ro: Operațiunea nu a putut fi executată deoarece elementul curent nu este parte al unui context de reversie.
ru: Операция не может быть завершена, так как текущий элемент не попадает в существующий контекст отмены.

# ItemNotInEditModeExceptionDefaultMessage
source: The operation could not be completed as the current item is not in edit mode.
de: Der Vorgang konnte nicht abgeschlossen werden, da sich das aktuelle Element nicht im Bearbeitungsmodus befindet.
es: No se pudo completar la operación como el elemento actual no está en modo de edición.!
fr: L'opération n'a pas pu être terminée car l'élément actuel n'est pas en mode édition.
hi: वर्तमान आइटम एडिट मोड में नहीं होने के कारण ऑपरेशन पूरा नहीं हो सका।
it: L'operazione potrebbe non essere completata come l'elemento corrente non è in modalità di modifica.
ja: 現在の項目が編集モードでないと、操作を完了できませんでした!。
ro: Operațiunea nu a putut fi executată deoarece elementul nu este în modul de editare.
ru: Операция не может быть завершена, так как текущий элемент не находится в режиме редактирования.

# OperationItemTypeError
source: The type of the argument is not a compatible type to the list.
de: Der Typ des Arguments ist keinen kompatiblen Typ hinzu.
es: El tipo del argumento no es un tipo compatible a la lista.!
fr: Le type de l’argument n’est pas un type compatible à la liste.
hi: तर्क का प्रकार सूची में एक संगत प्रकार नहीं है।
it: Il tipo dell'argomento non è un tipo compatibile all'elenco.
ja: 引数の型がリストに互換性のある型ではありません!。
ro: Tipul de argument nu este un tip compatibil cu lista.
ru: Тип аргумента не совместим со списком.

# ErrorArgumentNotPositiveInteger
source: The argument is not a positive integer.
de: Das Argument ist keine positive ganze Zahl.
es: El argumento no es un entero positivo.
fr: L’argument n’est pas un entier positif.
hi: तर्क एक सकारात्मक पूर्णांक नहीं है ।
it: L'argomento non è un numero intero positivo.
ja: 引数が正の整数ではありません。
ro: Argumentul nu este un întreg pozitiv.
ru: Аргумент не является положительным целым числом.

# SingleOrDefaultMultipleElements
source: The input sequence contains more than one element.
de: Die Eingabesequenz enthält mehr als ein Element.
es: La secuencia de entrada contiene más de un elemento.
fr: La séquence d’entrée contient plusieurs éléments.
hi: इनपुट सीक्वेंस में एक से अधिक तत्व होते हैं।
it: La sequenza di input contiene più di un elemento.
ja: 入力シーケンスに複数の要素が含まれています。
ro: Secvența de intrare conține mai multe elemente.
ru: Входная последовательность содержит более одного элемента.

# AnInvalidSetOfArgumentsWasSpecifiedArgumentNames
source: An invalid set of arguments was specified. Argument names: {0}
de: Ein ungültiger Satz von Argumenten wurde angegeben. Argumentnamen: {0}
es: Se especificó un conjunto de argumentos no válido. Nombres de argumentos: {0}
fr: Un ensemble d’arguments non valide a été spécifié. Noms d’arguments : {0}
hi: तर्कों का एक अमान्य सेट निर्दिष्ट किया गया था । तर्क के नाम: {0}
it: È stato specificato un insieme non valido di argomenti. Nomi degli argomenti: {0}
ja: 無効な引数のセットが指定されました。引数名: {0}
ro: S-a specificat un set nevalid de argumente. Nume argumente: {0}
ru: Указан недопустимый набор аргументов. Имена аргументов: {0}

# TheProvidedArgumentsDoNotFormAValidRangeOfValuesArguments
source: The provided arguments do not form a valid range of values. Arguments: {0}
de: Die angegebenen Argumente bilden keinen gültigen Wertebereich. Argumente: {0}
es: Los argumentos proporcionados no forman un intervalo válido de valores. Argumentos: {0}
fr: Les arguments fournis ne forment pas une plage de valeurs valide. Arguments : {0}
hi: प्रदान किए गए तर्क मूल्यों की एक वैध श्रृंखला नहीं बनाते हैं। तर्क: {0}
it: Gli argomenti forniti non formano un intervallo di valori valido. Argomenti: {0}
ja: 指定された引数は、有効な値の範囲を形成しません。引数: {0}
ro: Argumentele furnizate nu formează un interval valid de valori. Argumente: {0}
ru: Предоставленные аргументы не образуют допустимый диапазон значений. Аргументы: {0}

# ErrorArgumentNotPositive
source: The argument is not a positive number.
de: Das Argument ist keine positive Zahl.
es: El argumento no es un número positivo.
fr: L’argument n’est pas un nombre positif.
hi: तर्क कोई सकारात्मक संख्या नहीं है ।
it: L'argomento non è un numero positivo.
ja: 引数が正の数ではありません。
ro: Argumentul nu este un număr pozitiv.
ru: Аргумент не является положительным числом.

# ErrorArgumentNullOrEmptyString
source: The string argument is null (Nothing in Visual Basic) or empty.
de: Das Argument string ist null (Nothing in Visual Basic) oder empty.
es: El argumento string es null (Nothing en Visual Basic) o está vacío.
fr: L’argument string est null (Nothing en Visual Basic) ou vide.
hi: स्ट्रिंग तर्क अशक्त है (दृश्य बुनियादी में कुछ भी नहीं) या खाली है।
it: L'argomento stringa è null (Nothing in Visual Basic) o vuoto.
ja: 文字列引数が null (Visual Basic では何もない) または空です。
ro: Argumentul șir este nul (Nimic în Visual Basic) sau gol.
ru: Строковый аргумент имеет значение null (Nothing в Visual Basic) или пустой.

# ErrorArgumentNullOrWhiteSpaceString
source: The string argument is null (Nothing in Visual Basic), empty or whitespace-only.
de: Das Argument string ist null (Nothing in Visual Basic), empty oder whitespace-only.
es: El argumento string es null (Nothing en Visual Basic), vacío o sólo en espacios en blanco.
fr: L’argument string est null (Nothing en Visual Basic), vide ou espace réservé.
hi: स्ट्रिंग तर्क अशक्त है (दृश्य बुनियादी में कुछ भी नहीं), खाली या व्हाइटस्पेस-केवल।
it: L'argomento stringa è null (Nothing in Visual Basic), vuoto o solo spazi vuoti.
ja: 文字列引数は null (Visual Basic では何もない)、空または空白のみの引数です。
ro: Argumentul șir este nul (Nimic în Visual Basic), gol sau doar spațiu alb.
ru: Строковый аргумент имеет значение null (Nothing в Visual Basic), пустой или только пробел.

# ErrorArgumentNullOrEmptyBinary
source: The argument is null (Nothing in Visual Basic) or an empty byte array.
de: Das Argument ist null (Nothing in Visual Basic) oder ein leeres Bytearray.
es: El argumento es null (Nothing en Visual Basic) o una matriz de bytes vacía.
fr: L’argument est null (Nothing en Visual Basic) ou un tableau d’octets vide.
hi: तर्क अशक्त (दृश्य बुनियादी में कुछ भी नहीं) या एक खाली बाइट सरणी है।
it: L'argomento è null (Nothing in Visual Basic) o una matrice di byte vuota.
ja: 引数が null (Visual Basic では何もない) または空のバイト配列です。
ro: Argumentul este null (Nimic în Visual Basic) sau o matrice de octeți goală.
ru: Аргумент имеет значение null (Nothing в Visual Basic) или пустой массив байтов.

# ErrorArgumentNullOrEmptyCollection
source: The collection argument is null (Nothing in Visual Basic) or empty.
de: Das Argument collection ist null (Nothing in Visual Basic) oder empty.
es: El argumento collection es null (Nothing en Visual Basic) o está vacío.
fr: L’argument collection est null (Nothing en Visual Basic) ou vide.
hi: संग्रह तर्क अशक्त है (दृश्य बुनियादी में कुछ भी नहीं) या खाली है।
it: L'argomento dell'insieme è null (Nothing in Visual Basic) o vuoto.
ja: コレクションの引数が null (Visual Basic では何もない) または空です。
ro: Argumentul colecției este nul (Nimic în Visual Basic) sau gol.
ru: Аргумент коллекции имеет значение null (Nothing в Visual Basic) или пуст.

source: A contract condition is not being met.
de: Eine Vertragsbedingung wird nicht erfüllt.
es: No se cumple una condición contractual.
fr: Une condition contractuelle n’est pas remplie.
hi: ठेके की शर्त पूरी नहीं हो पा रही है।
it: Non viene soddisfatta una condizione contrattuale.
ja: 契約条件が満たされていません。
ro: O condiție contractuală nu este îndeplinită.
ru: Условие контракта не выполняется.

# ErrorArgumentNotValidIndex
source: The argument cannot be considered a valid index.
de: Das Argument kann nicht als gültiger Index betrachtet werden.
es: El argumento no se puede considerar un índice válido.
fr: L’argument ne peut pas être considéré comme un index valide.
hi: तर्क को वैध सूचकांक नहीं माना जा सकता।
it: L'argomento non può essere considerato un indice valido.
ja: 引数は有効なインデックスと見なせません。
ro: Argumentul nu poate fi considerat un index valid.
ru: Аргумент нельзя считать допустимым индексом.

# ErrorArgumentNotValidLength
source: The argument cannot be considered a valid length, as it has to be a positive integer less than the length of the collection it is used for.
de: Das Argument kann nicht als gültige Länge betrachtet werden, da es eine positive ganze Zahl sein muss, die kleiner ist als die Länge der Auflistung, für die es verwendet wird.
es: El argumento no se puede considerar una longitud válida, ya que tiene que ser un entero positivo menor que la longitud de la colección para la que se utiliza.
fr: L’argument ne peut pas être considéré comme une longueur valide, car il doit s’agir d’un entier positif inférieur à la longueur de la collection pour laquelle il est utilisé.
hi: तर्क को वैध लंबाई नहीं माना जा सकता, क्योंकि इसके लिए उपयोग किए जाने वाले संग्रह की लंबाई से कम सकारात्मक पूर्णांक होना चाहिए।
it: L'argomento non può essere considerato una lunghezza valida, in quanto deve essere un numero intero positivo inferiore alla lunghezza dell'insieme per cui viene utilizzato.
ja: 引数は、使用されるコレクションの長さより小さい正の整数でなければならないため、有効な長さと見なすことはできません。
ro: Argumentul nu poate fi considerat o lungime validă, deoarece trebuie să fie un întreg pozitiv mai mic decât lungimea colecției pentru care este utilizat.
ru: Аргумент нельзя считать допустимой длиной, так как он должен быть положительным целым числом, меньшим длины коллекции, для которого он используется.

# ErrorArgumentNullOrEmptyArray
source: The array argument is null (Nothing in Visual Basic), or empty, or does not have the required length.
de: Das Argument array ist null (Nothing in Visual Basic) oder leer oder hat nicht die erforderliche Länge.
es: El argumento de matriz es null (Nothing en Visual Basic), o está vacío, o no tiene la longitud necesaria.
fr: L’argument array est null (Nothing en Visual Basic), vide ou n’a pas la longueur requise.
hi: सरणी तर्क अशक्त है (दृश्य बुनियादी में कुछ भी नहीं), या खाली है, या आवश्यक लंबाई नहीं है ।
it: L'argomento della matrice è null (Nothing in Visual Basic) o vuoto o non ha la lunghezza richiesta.
ja: 配列の引数が null (Visual Basic では何もない) であるか、空であるか、または必要な長さがありません。
ro: Argumentul matrice este null (Nimic în Visual Basic) sau gol sau nu are lungimea necesară.
ru: Аргумент массива имеет значение null (Nothing в Visual Basic), или пуст, или не имеет требуемой длины.

# ErrorArgumentDoesNotMatch
source: The argument does not match the expected pattern, or could not be implicitly matched to any supported input.
de: Das Argument stimmt nicht mit dem erwarteten Muster überein oder konnte nicht implizit einer unterstützten Eingabe zugeordnet werden.
es: El argumento no coincide con el modelo esperado o no se puede hacer coincidir implícitamente con ninguna entrada admitida.
fr: L’argument ne correspond pas au modèle attendu ou n’a pas pu être mis en correspondance implicitement avec une entrée prise en charge.
hi: तर्क अपेक्षित पैटर्न से मेल नहीं खाती है, या किसी भी समर्थित इनपुट से स्पष्टतः मेल नहीं खाती है।
it: L'argomento non corrisponde al modello previsto o non può essere abbinato in modo implicito a qualsiasi input supportato.
ja: 引数が予期されたパターンと一致しないか、サポートされているどの入力とも暗黙的に一致することができませんでした。
ro: Argumentul nu se potrivește cu modelul așteptat sau nu s-a potrivit implicit cu nicio intrare acceptată.
ru: Аргумент не соответствует ожидаемому шаблону или не может быть неявно сопоставлен с любым поддерживаемым входным данным.

# ErrorArgumentInvalidPath
source: The argument supplied cannot be used as a valid path.
de: Das angegebene Argument kann nicht als gültiger Pfad verwendet werden.
es: El argumento proporcionado no se puede utilizar como una ruta de acceso válida.
fr: L’argument fourni ne peut pas être utilisé comme chemin d’accès valide.
hi: आपूर्ति किए गए तर्क को वैध मार्ग के रूप में उपयोग नहीं किया जा सकता है।
it: L'argomento fornito non può essere utilizzato come percorso valido.
ja: 指定された引数を有効なパスとして使用することはできません。
ro: Argumentul furnizat nu poate fi utilizat ca o cale validă.
ru: Предоставленный аргумент нельзя использовать в качестве допустимого пути.

# ErrorKeyFoundInDictionary
source: The given key was already present in the dictionary.
de: Der angegebene Schlüssel war bereits im Wörterbuch vorhanden.
es: La clave dada ya estaba presente en el diccionario.
fr: La clé donnée était déjà présente dans le dictionnaire.
hi: दी गई चाबी पहले से ही शब्दकोश में मौजूद थी।
it: La chiave fornita era già presente nel dizionario.
ja: 指定されたキーは既に辞書に存在していました。
ro: Cheia dată era deja prezentă în dicționar.
ru: Данный ключ уже присутствовал в словаре.

# ErrorQueueIsEmpty
source: The queue is currently empty.
de: Die Warteschlange ist derzeit leer.
es: La cola está actualmente vacía.
fr: La file d’attente est actuellement vide.
hi: फिलहाल कतार खाली है।
it: La coda è attualmente vuota.
ja: キューは現在空です。
ro: Coada este în prezent goală.
ru: В настоящее время очередь пуста.

# ErrorStackIsEmpty
source: The stack is currently empty.
de: Der Stapel ist derzeit leer.
es: La pila está actualmente vacía.
fr: La pile est actuellement vide.
hi: फिलहाल ढेर खाली है।
it: Lo stack è attualmente vuoto.
ja: スタックは現在空です。
ro: Stiva este în prezent goală.
ru: Стек в настоящее время пуст.

# LimitArgumentNegativeExceptionDefaultTextNoArgument
source: Limit argument must be a non-negative integer.
de: Das Argument limit muss eine nicht negative ganze Zahl sein.
es: El argumento Limit debe ser un entero no negativo.
fr: L’argument Limit doit être un entier non négatif.
hi: सीमित तर्क एक गैर नकारात्मक पूर्णांक होना चाहिए ।
it: L'argomento Limite deve essere un numero intero non negativo.
ja: Limit 引数は負でない整数でなければなりません。
ro: Argumentul limită trebuie să fie un întreg non-negativ.
ru: Аргумент Limit должен быть неотрицательным целым числом.

# LimitArgumentNegativeExceptionDefaultTextWithArgument
source: Limit argument must be a non-negative integer. Argument name: {0}
de: Das Argument limit muss eine nicht negative ganze Zahl sein. Argumentname: {0}
es: El argumento Limit debe ser un entero no negativo. Nombre del argumento: {0}
fr: L’argument Limit doit être un entier non négatif. Nom de l’argument : {0}
hi: सीमित तर्क एक गैर नकारात्मक पूर्णांक होना चाहिए । तर्क का नाम: {0}
it: L'argomento Limite deve essere un numero intero non negativo. Nome argomento: {0}
ja: Limit 引数は負でない整数でなければなりません。引数名: {0}
ro: Argumentul limită trebuie să fie un întreg non-negativ. Nume argument: {0}
ru: Аргумент Limit должен быть неотрицательным целым числом. Имя аргумента: {0}
